In [1]:
import pandas as pd

In [7]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('/home/mariotury/Desktop/DataScience/Resources/SampleData/Py4Analysis/ml-latest-small/movies.csv',sep=',', header=0,
names=mnames)

In [8]:
movies[:5]

,movie_id,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [16]:
tags = pd.read_table('/home/mariotury/Desktop/DataScience/Resources/SampleData/Py4Analysis/ml-latest-small/tags.csv',sep=',', header=0
                )
ratings = pd.read_table('/home/mariotury/Desktop/DataScience/Resources/SampleData/Py4Analysis/ml-latest-small/ratings.csv',sep=',', header=0
                )
data = pd.merge(tags,ratings)

In [20]:
ratings[:5]
# data

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144
1       1     1029     3.0  1260759179
2       1     1061     3.0  1260759182
3       1     1129     2.0  1260759185
4       1     1172     4.0  1260759205

In [21]:
tags[:5]

   userId  movieId                      tag   timestamp
0      15      339  sandra 'boring' bullock  1138537770
1      15     1955                  dentist  1193435061
2      15     7478                 Cambodia  1170560997
3      15    32892                  Russian  1170626366
4      15    34162              forgettable  1141391765

In [25]:
data.userid[1]

AttributeError: 'DataFrame' object has no attribute 'userid'